{
  "id": 32,
  "title": "RELEASE_NOTES_v1.2",
  "body": "🌐 URL → OPML (v1.2.1)\n\nTurn any web page into a clean, navigable OPML outline — in one click.\nNo clutter. No ads. Just the structure.\n\nWhy this is exciting\n\n⚡ Fast signal extraction: Skip the noise and scan a page as an outline.\n\n🧭 Instant navigation: Expand/collapse headings with carets right in FunKit.\n\n🧰 Portable: OPML plays nicely with other outline tools.\n\nHow to use it\n\nOption A — Toolbar\n\nClick URL → OPML.\n\nPaste one or more URLs (newline-separated).\n\nPress OK. The first outline opens automatically; others appear in the index.\n\nOption B — Menu\n\nFile → Import URL → OPML (same dialog as above)\n\nBatch import: paste multiple URLs at once — each becomes its own OPML document.\n\nModes & control\n\nTools → Network/URL → URL Import Mode\n\nQuick (default): ~12s total / ~600 KB per URL\n\nFull: ~25s total / ~2.5 MB per URL\n\n🛑 Cancelable: A small “Fetching URLs…” dialog lets you Cancel mid-import.\n\n🧵 Responsive: Fetch runs in the background; the UI stays snappy.\n\n💾 Safe writes: All database updates happen on the main thread (no SQLite thread errors).\n\nWhat gets saved\n\n✅ New OPML documents titled like: Example Page Title (OPML)\n\n🔒 Original HTML is not stored (we harvest structure, not the entire page)\n\nRendering & navigation\n\n🪄 OPML opens in the main pane with caret expand/collapse.\n\n⬅️ Back returns to your previous document.\n\n🔍 Use the Tree view anytime for a dedicated outline window.\n\nSmart fallbacks\n\nSome sites are heavy or defensive (big publisher CDNs, paywalls, etc.). We handle that:\n\n🧠 HTML → OPML (primary path)\n\n✨ Text fallback when HTML is tricky — still produces a useful outline\n\n🧪 Validation: OPML is parsed in-memory before saving; leading noise is trimmed\n\n🛠️ Repair tools:\n\nTools → Repair current doc → OPML (overwrite)\n\nBatch: Repair selected OPML docs (toolbar)\n\nTips for great outlines\n\nPrefer article / reader URLs when possible (less nav/UI chrome).\n\nMulti-URL imports are supported — each URL on its own line.\n\nFor very stubborn sites, try Quick mode first; if needed, switch to Full.\n\nTroubleshooting\n\nSpinner lasts too long\n• Use Quick mode, then try Cancel if the site slow-walks content.\n• Try Full mode for larger articles.\n\n“Unsupported Content-Type”\n• The URL isn’t HTML/XML (e.g., PDF, image). Convert text separately or use other import options.\n\nOutline looks too minimal\n• That’s the text fallback. Try Full mode, or use the Repair tool on the document.\n\nOptional dependencies (improves fetching)\nAlways show details\npip3 install requests chardet\n\n\nrequests → better TLS/redirects & streaming\n\nchardet → smarter encoding detection\n\nRelated features\n\n🗂️ Batch: Create OPML copies (left-pane multi-select → toolbar button) — non-destructive\n\n⚙️ OPML Preferences (Tools → OPML Preferences):\n• After Convert: Open / Link / Open+Link\n• Batch: optional header link in originals\n\nWhy OPML (again)?\n\nOPML is a timeless, lightweight way to think in outlines — a perfect bridge between Doug Engelbart’s vision and today’s web. By harvesting structure from pages, FunKit helps you tame the noisy web into something you can scan, reorganize, and reason about.\n\nQuick start\n\nInstall & launch FunKit\n\nClick URL → OPML on the toolbar\n\nPaste a URL (or many), hit OK\n\nExpand the carets and get the gist in seconds ✨\nEOF\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}