{
  "id": 38,
  "title": "Why_Stable_Links_Matter",
  "body": "## 1. Why “stable, granular links” matter – the promise in plain language  \n\nImagine you are writing a research paper, a product design spec, or a personal knowledge‑base.  You spend hours turning a paragraph into a *deep link* that you can hand to a teammate, paste into a chat, or embed in a web page.  In today’s tools that link is fragile: if you later move the paragraph, the link points to the wrong place or breaks entirely.  Our **crisp promise** is therefore:\n\n> **“You can create a link that points to a precise block, line, or even a sentence, and that link will still land on the same logical piece of text after the document is edited.”**\n\nThe only new term you need to keep straight is **deep link** – a URL that encodes not just the file name but also a *stable identifier* for a tiny piece of content (block, paragraph, or sentence).  All other jargon (e.g., *transclusion*, *lens*) will be introduced as we go.\n\n---\n\n## 2. Concrete MVP workflows – a step‑by‑step narrative  \n\n### 2.1 Create and share a deep link  \n\n1. **Open a Markdown file** called `Design‑Addressing.md`.  \n2. **Select the third paragraph** (the one that explains “Stability”).  \n3. Press **⌘ L** (or **Ctrl L**) – the app generates a link that looks like  \n\n   ```\n   hs://my‑workspace/Design‑Addressing.md#b=3e2f1a9c‑c0d4‑4a7b‑b8e1‑f5a2e3c9d0b1\n   ```\n\n   The `b=` part is a **block‑GUID** – a 128‑bit hash that is derived from the exact text of the paragraph *and* its surrounding outline, so the identifier is unique and reproducible.  \n\n4. **Copy** the link and **paste** it into a Slack message.  \n\nWhen a colleague clicks the link, the app opens `Design‑Addressing.md`, scrolls to the paragraph, and highlights it.  If later you move the paragraph to a different position, the same link still resolves because the block‑GUID is still present in the file’s content.\n\n### 2.2 View multiple “lenses” of the same document  \n\nA *lens* is simply a different visual representation of the same underlying data.  In our MVP you can toggle three lenses:\n\n* **Full‑text view** – the raw Markdown with all formatting.  \n* **Outline view** – a collapsible tree that shows headings and the block‑GUIDs underneath.  \n* **Backlink view** – a list of every other document that contains a deep link pointing into the current file.\n\nAll three panes are synchronized: clicking a node in the outline automatically scrolls the full‑text view and updates the backlink pane.  This *multi‑view* pattern lets you navigate large knowledge bases without losing context.\n\n### 2.3 Transclude a block (live‑embed)  \n\nSuppose you are writing a “Project‑Roadmap.md” and you want the *Stability* paragraph from `Design‑Addressing.md` to appear there, always up‑to‑date.  \n\n1. In `Project‑Roadmap.md` type `{{hs://my‑workspace/Design‑Addressing.md#b=3e2f1a9c…}}`.  \n2. The editor renders the paragraph inline, but under the hood it stores a **transclusion reference** – a pointer to the source block‑GUID.  \n\nIf the source paragraph is edited (e.g., you add a sentence), the transcluded view updates instantly the next time you open the file.  No copy‑and‑paste is required, and you never have to worry about the source moving.\n\n---\n\n## 3. Technical scaffolding – how we keep the binary tiny and fast  \n\n### 3.1 Core language and libraries  \n\n* **Rust** – a systems language that guarantees memory safety without a garbage collector, producing static binaries under 50 MiB.  \n* **Pulldown‑cmark** – a fast Markdown parser that yields a stream of *events* (e.g., “StartParagraph”, “Text”).  \n* **SQLite** (via `rusqlite`) – an embedded relational store for the index of"
}