{
  "id": 75,
  "title": "deepseek_hypertext_parser_analysis",
  "body": "We are given a Python script that defines a function `parse_links` for a Tkinter Text widget. The function scans the given raw text for markdown-style links (e.g., `[label](doc:123)`) and replaces them with clickable links in the Text widget.\nHowever, note that the current implementation has a potential issue with variable capture in the closure. Specifically, the loop variable doc_id is used in a closure that is created in a loop. This can lead to all callbacks using the last value of doc_id (a common late-binding closure issue).\n\nThe current code attempts to avoid this by using a default argument in the lambda: _did=did. This should work because the default argument is evaluated at the time the lambda is defined.\n\nBut note: the variable did is captured from the loop. The function _make_callback is called with doc_id (which is passed as did). Since did is a parameter of _make_callback, and we are setting a default argument in the lambda to _did=did, it should capture the current value of did for each iteration.\n\nHowever, let me double-check: The function _make_callback is called immediately in the loop for each match, passing the current doc_id as did. Then, inside, we define a lambda that has a default argument _did set to did (which is the current value in the loop). So when the event occurs, it will use the default argument _did which was captured at the time of the lambda's creation.\n\nTherefore, the code should work correctly.\n\nBut note: the _make_callback function is defined inside the loop. We can avoid this by using a simpler lambda that captures the current doc_id directly. However, because of the way Python closures work, without the default argument trick we would have a problem.\n\nAlternatively, we can use a more straightforward approach by using functools.partial or by binding the value in a way that doesn't rely on the loop variable.\n\nHowever, the current code is acceptable.\n\nAnother note: the function deletes the tag \"link\" at the beginning. This means that if you call this function multiple times (on the same text widget) it will remove the previous links. This is intended.\n\nSteps in the function:\n\nDelete the tag \"link\" to remove any existing link tags.\nConfigure the \"link\" tag again (with green foreground and underline).\nIterate over each match of the pattern in the raw_text.\nFor each match, compute the start and end indices in the Text widget (which already has the raw_text).\nAdd the \"link\" tag to that span.\nBind a callback to the \"link\" tag for the Button-1 event. The callback is built by a helper function _make_callback that creates a lambda capturing the current doc_id.\nPotential improvement: Instead of deleting the tag and reconfiguring, we could just reconfigure it once? But deleting the tag also removes all regions tagged, which is what we want because we are going to retag the links. Also, note that tag configurations (like color) persist even after deletion? Actually, deleting the tag removes the configuration. So we have to reconfigure.\n\nAlternatively, we could avoid deleting the tag and instead remove the tag from all regions? But the tag_remove method would require knowing every region. So deleting the tag is simpler.\n\nHowever, note: deleting the tag and then reconfiguring it again every time we parse links might be acceptable.\n\nLet me write an alternative without the inner function:\n\nWe can replace the inner function with: text_widget.tag_bind(\"link\", \"\", lambda event, did=doc_id: on_open_doc(int(did)), add='+')\n\nBut wait: the tag_bind method for a tag replaces the previous binding if we don't set add='+'. However, we are binding the same event to the same tag multiple times. We want multiple links to work independently.\n\nThe problem: if we bind the event multiple times to the same tag, then when the event happens, all the callbacks will be called? But actually, Tkinter tag bindings do not work that way. When you bind an event to a tag, it replaces the previous binding for that event and tag. So if we do:\n\n    text_widget.tag_bind(\"link\", \"<Button-1>\", callback1)\n    text_widget.tag_bind(\"link\", \"<Button-1>\", callback2)\nThen only callback2 will be called.\n\nTherefore, we cannot use the same tag for multiple links and bind each one to a different callback by using multiple tag_bind calls. The code currently does a tag_bind for each link, but each time it uses the same tag \"link\". This will overwrite the previous binding.\n\nHow does the current code avoid that? It doesn't. It has the same issue: the last binding will be the only one that remains.\n\nCorrection: the current code is binding the callback to the \"link\" tag for each link. But each binding replaces the previous one. So only the last link will work.\n\nThis is a bug.\n\nHow to fix?\n\nWe must have a unique tag for each link? Or we can use a different approach.\n\nAlternatively, we can bind a single event handler to the entire \"link\" tag, and then in the event handler, figure out which link was clicked.\n\nHow? We can use the index method of the Text widget to get the current cursor position, and then check which tagged link that position falls into.\n\nSteps for the alternative approach:\n\n 1. Create a tag for each link? But that might be messy.\n\n 2. Or, we can have one tag for all links and then store the associated doc_ids in a dictionary keyed by the start and end indices? But then we have to look up based on the current index.\nActually, we can do:\n\n    text_widget.tag_bind(\"link\", \"<Button-1>\", lambda event: handle_link_click(event, text_widget, on_open_doc))\nAnd then in handle_link_click:\n\n    index = text_widget.index(tk.CURRENT)\n    # Get all tags at the current index\n    tags = text_widget.tag_names(index)\n    if \"link\" in tags:\n        # But then how do we know which doc_id? We don't have stored per region.\nWe would have to store the doc_id information somewhere. We could store it in the tag itself? Actually, Tkinter tags don't have data storage.\n\nAlternatively, we can create a mapping from the index range to the doc_id. But we don't have a way to store arbitrary data on the Text widget.\n\nAnother idea: create a unique tag for each link? Then we can bind the same callback to each tag, and the callback can be set once per tag.\n\nLet's restructure:\n\n    tag_name = f\"link_{doc_id}_{start_idx}\"   # or something unique)\n\n    # Create the tag\n    text_widget.tag_configure(tag_name, ...)\n    text_widget.tag_add(tag_name, start_idx, end_idx)\n\n    def callback(event, did=doc_id):\n        on_open_doc(int(did))\n\n    text_widget.tag_bind(tag_name, \"<Button-1>\", callback)\nBut note: we are creating many tags. We must clean them up? Yes, because we call parse_links multiple times. So we would have to delete all the old tags? We can't easily delete all tags starting with \"link_\".\n\nAlternatively, we can delete all tags that we created in the previous parse? We would have to remember them.\n\nHowever, note: the existing code deletes the \"link\" tag. We can extend that to delete all tags that match a pattern.\n\nBut let's reconsider: the existing method of using one tag for appearance and then trying to bind events per region doesn't work because of the overwriting.\n\nAnother idea: use the same tag for all links, but then in the event handler, we iterate over the links we know about (from the current parse) and check which one contains the current index.\n\nWe would need to store the ranges and the associated doc_ids. We can store that in a list and attach it to the text widget.\n\nHow about:\n\n    text_widget._links = []   # each element: (start, end, doc_id)\n\n    for match in ...:\n        ...\n        text_widget._links.append( (start_idx, end_idx, doc_id) )\n\n    Then, bind a single event handler to the tag \"link\" that:\n\n      - gets the current index (in the event)\n      - searches through the list of links to find the one that contains the index\n      - calls on_open_doc for that doc_id\nBut note: the indices in the list are string indices (like \"1.0+5c\") and we need to compare them with the current index (which is also a string). We can convert the current index to the canonical form? Or use the Text widget's compare method.\n\nExample:\n\n    tags = text_widget.tag_names(index)\n    if \"link\" in tags:\n        for (start, end, doc_id) in text_widget._links:\n            if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                on_open_doc(int(doc_id))\n                break\nWe can do this.\n\nSteps:\n\n    In the beginning of the function:\n        # Store the links info for the current parse\n        if hasattr(text_widget, '_links'):\n            text_widget._links = []   # reset\n        else:\n            text_widget._links = []\n\n        # Also, delete the tag \"link\" and reconfigure\n        text_widget.tag_delete(\"link\")\n        text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n\n    For each match:\n        ... as before ...\n        text_widget._links.append( (start_idx, end_idx, doc_id) )\n        text_widget.tag_add(\"link\", start_idx, end_idx)\n\n    Then, we bind a single event to the \"link\" tag:\n\n        text_widget.tag_bind(\"link\", \"<Button-1>\", lambda event: self._on_link_clicked(event, text_widget, on_open_doc))\n\n    We define a helper function (inside parse_links? or outside) but note: we are inside a function. We can define the handler inside.\n\n    Or we can define the handler as a nested function:\n\n        def _on_link_clicked(event):\n            # Get the current index at the click\n            index = text_widget.index(tk.CURRENT)\n            # Check each stored link\n            for (start, end, doc_id) in text_widget._links:\n                if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                    on_open_doc(int(doc_id))\n                    break\n\n        text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n\n    But note: we are binding the same event every time we call parse_links? And we call parse_links multiple times? Then we would have multiple bindings? Actually, no: because we are binding to the tag \"link\", and we are replacing the binding each time? Actually, yes: the last binding will be the one that remains? Or does Tkinter accumulate handlers? \n\n    The documentation: \n        \"When a tag is is created, it has no event handlers. The tag_bind method adds an event handler to a tag. Multiple event handlers may be added to a tag. The order of the event handlers is undefined.\"\n\n    Wait, multiple bindings? But in the code above, we are binding the same event multiple times? Then the same event will fire multiple handlers? \n\n    Actually, the Tkinter Text widget tag_bind method replaces the previous binding for the same event sequence? Or adds? The standard Tkinter widgets usually replace the binding. But the documentation says: \"Multiple event handlers may be added to a tag.\" So it accumulates.\n\n    Therefore, if we call parse_links multiple times, we will be adding multiple bindings. That would be bad.\n\n    How to fix? We can unbind any old handlers? Or we can do a single binding outside the loop and update the stored links.\n\n    Alternatively, we can do the binding once when the text widget is created? But the parse_links function is called to update the links.\n\n    So we need to unbind the previous binding for the tag \"link\" and event \"<Button-1>\"?\n\n    Actually, the tag_bind method without a callback argument returns the current binding? But Tkinter doesn't have an unbind for tags? \n\n    Alternatively, we can store the binding id and then use tag_unbind? But Tkinter doesn't have that.\n\n    Another idea: we break the binding and do it only once? How? We can check if we have already bound the handler? Then if so, skip binding again.\n\n    We can set a flag on the text widget:\n\n        if not hasattr(text_widget, '_link_handler_bound'):\n            text_widget.bind_class(\"link\", \"<Button-1>\", _on_link_clicked)\n            text_widget._link_handler_bound = True\n\n    But note: the event handler uses the current `text_widget._links` which is updated each time we parse. So that should be fine.\n\n    However, we are defining the function `_on_link_clicked` inside `parse_links` every time. That would create a new function each time. And we are binding it again? Then we have multiple bindings.\n\n    Instead, we can define the handler once and then just update the `text_widget._links`?\n\n    How about:\n\n        We define the handler outside? But then it wouldn't have access to `text_widget` and `on_open_doc`? Actually, we can design it to use the text_widget.\n\n    Alternatively, we can do:\n\n        Only bind the handler once, and then update the links list.\n\n    Steps:\n\n        We'll create a helper function that does the binding setup once:\n\n        def _bind_link_handler(text_widget, on_open_doc):\n            def _on_link_clicked(event):\n                index = text_widget.index(tk.CURRENT)\n                # If we have stored links, check them\n                if hasattr(text_widget, '_links'):\n                    for (start, end, doc_id) in text_widget._links:\n                        if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                            on_open_doc(int(doc_id))\n                            break\n            # Bind only once\n            if not hasattr(text_widget, '_link_handler_bound'):\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n        Then in parse_links, we call _bind_link_handler(text_widget, on_open_doc) once? But note: `on_open_doc` might change? Then we capture the current one.\n\n    Actually, we can do:\n\n        We attach the current `on_open_doc` to the text_widget? Or we can rely on the closure to capture the current `on_open_doc`? But the handler is fixed at the time of binding.\n\n    Alternatively, we can change the design: have the parse_links function store the current `on_open_doc` in the text_widget? Then the handler doesn't need to capture it.\n\n    But the handler already uses `on_open_doc` from the closure. If we bind the handler once, it will capture the first `on_open_doc` passed. But if we call parse_links again with a different `on_open_doc`, then the handler will still call the old one.\n\n    Therefore, we must update the callback? So we cannot bind once.\n\n    Considering the complexity, I propose the following:\n\n        For now, we stick with the original method of creating a unique tag per link? But then we have to manage the tags.\n\n    Let me try the unique tag approach:\n\n        We'll generate a unique tag name for each link.\n\n        We can delete all tags that start with \"link_\" at the beginning of parse_links? Then we don't have to remember them.\n\n        Steps:\n\n            # Delete all tags that start with \"link_\"\n            for tag_name in text_widget.tag_names():\n                if tag_name.startswith(\"link_\"):\n                    text_widget.tag_delete(tag_name)\n\n            # Also, create the common tag for appearance? Actually, we want all links to look the same. So we can have a base tag \"link\" for appearance and then add the unique tag? But tags can be combined.\n\n            # Alternatively, configure the unique tag to have the same appearance? But that is inefficient.\n\n        Instead, we can keep the base tag \"link\" for appearance? Then we just add the base tag to the text? And then we add a unique tag for the binding? But then we have two tags: one for style and one for binding? And we can bind the event to the unique tag?\n\n        Example:\n\n            tag_name = \"link_bind_\" + str(idx)   # but idx might be the same if called multiple times\n\n        Or we can use the doc_id and the index? How about:\n\n            unique_tag = f\"link_{doc_id}_{match.start()}\"\n\n        Steps:\n\n            # Configure the base tag \"link\" for appearance (just once, at the beginning of the function)\n            text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n\n            for match in ...:\n                ...\n                # Create a unique tag for binding\n                unique_tag = f\"link_{doc_id}_{match.start()}\"\n                text_widget.tag_add(\"link\", start_idx, end_idx)\n                text_widget.tag_add(unique_tag, start_idx, end_idx)\n\n                # Bind the callback to the unique_tag\n                def callback(event, did=doc_id):\n                    on_open_doc(int(did))\n                text_widget.tag_bind(unique_tag, \"<Button-1>\", callback)\n\n            But note: we are adding two tags? Then the text has both tags. The binding will work on the unique_tag.\n\n        However, we must delete the unique tags from previous calls? We already do: we delete all tags that start with \"link_\" at the beginning.\n\n        But then we also delete the appearance tag \"link\"? We cannot do that because we are deleting by prefix. So we should avoid deleting the base tag.\n\n        Alternatively, we can skip deleting the base tag? We'll delete only tags that start with \"link_bind_\" or something distinct.\n\n        Actually, we can:\n\n            # Delete all tags that start with \"link_bind_\" (if we use a prefix \"link_bind_\")\n            for tag_name in text_widget.tag_names():\n                if tag_name.startswith(\"link_bind_\"):\n                    text_widget.tag_delete(tag_name)\n\n        Then we leave the tag \"link\" alone.\n\n        But note: we are going to reconfigure the tag \"link\" every time? We don't need to if we only do it once. Maybe we can do it once externally? Or we can do:\n\n            if not hasattr(text_widget, '_link_tag_configured'):\n                text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n                text_widget._link_tag_configured = True\n\n        Then in the beginning of parse_links:\n\n            # Delete all the binding tags\n            for tag_name in text_widget.tag_names():\n                if tag_name.startswith(\"link_bind_\"):\n                    text_widget.tag_delete(tag_name)\n\n        Then for each link:\n\n            unique_tag = f\"link_bind_{doc_id}_{match.start()}\"\n            text_widget.tag_add(\"link\", start_idx, end_idx)\n            text_widget.tag_add(unique_tag, start_idx, end_idx)\n\n            # Bind the callback to the unique_tag\n            text_widget.tag_bind(unique_tag, \"<Button-1>\", lambda event, did=doc_id: on_open_doc(int(did)))\n\n        Note: the lambda uses the late-binding issue? We capture doc_id by value via default argument.\n\n        Also, note: we are creating a new tag for each link. This might be inefficient if there are many links? But in a typical document, there aren't that many.\n\n    However, the original code had a bug: the link binding was overwritten. We fix that by using unique tags.\n\n    Alternatively, we can use the single tag with a stored list of links and a single event handler. We can avoid multiple bindings by binding the event only once? But then we must update the stored list of links.\n\n    Let me try that:\n\n        In parse_links:\n\n            # Store the list of links in text_widget._links (as a list of (start, end, doc_id))\n            text_widget._links = []\n\n            # Bind the event handler only once (if not already bound)\n            if not hasattr(text_widget, '_link_handler_bound'):\n                def _on_link_clicked(event):\n                    index = text_widget.index(tk.CURRENT)\n                    if hasattr(text_widget, '_links'):\n                        for (start, end, doc_id) in text_widget._links:\n                            if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                                on_open_doc(int(doc_id))\n                                break\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n            # Now, for each match, we just append to text_widget._links and add the tag \"link\"\n\n        But note: the closure for _on_link_clicked uses the current `on_open_doc`? And we are binding only once. So if parse_links is called again with a different `on_open_doc`, the handler will still call the old one.\n\n        How to fix? We can attach the `on_open_doc` to the text_widget? Then the handler uses the text_widget._on_open_doc? But parse_links receives `on_open_doc` each time. We would have to update it.\n\n        Alternatively, we can design such that the same `on_open_doc` function is always used? That might be the case.\n\n        Or, we can change the design: have a single function that is set once and for all? Then it's fixed.\n\n        But the problem: the function `parse_links` is called by some other code that might pass a different `on_open_doc` each time? Probably not: likely it's the same function.\n\n        However, to be safe, we can store the current `on_open_doc` in the text_widget? Then update it each time.\n\n        Then:\n\n            text_widget._on_open_doc = on_open_doc\n\n            And in the handler, call text_widget._on_open_doc\n\n        Steps:\n\n            text_widget._links = []   # reset the list of links for this parse\n            text_widget._on_open_doc = on_open_doc   # update the current handler\n\n            # Then bind the event if not bound?\n\n            if not hasattr(text_widget, '_link_handler_bound'):\n                def _on_link_clicked(event):\n                    index = text_widget.index(tk.CURRENT)\n                    if hasattr(text_widget, '_links'):\n                        for (start, end, doc_id) in text_widget._links:\n                            if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                                text_widget._on_open_doc(int(doc_id))\n                                break\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n            Then for each match, append to text_widget._links and add the tag \"link\".\n\n        This way, we only bind once, and we update the stored links and the current on_open_doc each time we parse.\n\n    Let's go with this approach.\n\n    Summary of the function with this approach:\n\n        import tkinter as tk\n\n        ... same ...\n\n        def parse_links(text_widget: tk.Text, raw_text: str, on_open_doc):\n            # Store the current on_open_doc function and reset the links list\n            text_widget._on_open_doc = on_open_doc\n            text_widget._links = []   # list of tuples (start, end, doc_id)\n\n            # Delete the old tag \"link\" and reconfigure\n            text_widget.tag_delete(\"link\")\n            text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n\n            # Bind the event handler if not already bound\n            if not hasattr(text_widget, '_link_handler_bound'):\n                def _on_link_clicked(event):\n                    index = text_widget.index(tk.CURRENT)\n                    # Check each stored link\n                    for (start, end, doc_id) in text_widget._links:\n                        if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                            # Use the stored on_open_doc function\n                            text_widget._on_open_doc(int(doc_id))\n                            break\n\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n            # Now process the matches\n            for match in LINK_PATTERN.finditer(raw_text):\n                label, doc_id = match.groups()\n                start_idx = f\"1.0+{match.start()}c\"\n                end_idx = f\"1.0+{match.end()}c\"\n\n                # Add the tag \"link\" to this span\n                text_widget.tag_add(\"link\", start_idx, end_idx)\n\n                # Store the link info in text_widget._links\n                text_widget._links.append( (start_idx, end_idx, doc_id) )\n\n    Note: the function `_on_link_clicked` is defined only once and then reused. We update `text_widget._links` and `text_widget._on_open_doc` each time we parse.\n\n    This should work.\n\n    However, note: the stored `text_widget._links` is replaced with a new list each time. And we update `text_widget._on_open_doc` to the latest function.\n\n    Potential issue: if multiple parse_links are in progress? But typically, we parse one by one.\n\n    Also, note: the tag_bind is done only once. We assume that the text widget will persist and be reused.\n\n    Let's test: if we call parse_links multiple times, each time we update the list of links and the on_open_doc function. Then when a link is clicked, it uses the latest on_open_doc and the latest list of links.\n\n    What if the text widget is reused for different content? Then we are storing the new links and the new on_open_doc. That should be fine.\n\n    Also, note: the tag \"link\" is deleted and re-added each time. That is expected.\n\n    So here is the revised code:\n\n        import re\n        import tkinter as tk\n\n        LINK_PATTERN = re.compile(r\"\\[([^\\]]+)]\\(doc:(\\d+)\\)\")\n\n\n        def parse_links(text_widget: tk.Text, raw_text: str, on_open_doc):\n            # Update the stored function and reset the links list\n            text_widget._on_open_doc = on_open_doc\n            text_widget._links = []\n\n            # Reset the Text widget's link tag\n            text_widget.tag_delete(\"link\")\n            text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n\n            # Bind the event handler if not bound already\n            if not hasattr(text_widget, '_link_handler_bound'):\n                def _on_link_clicked(event):\n                    index = text_widget.index(tk.CURRENT)\n                    links = getattr(text_widget, '_links', [])\n                    for (start, end, doc_id) in links:\n                        if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                            text_widget._on_open_doc(int(doc_id))\n                            break\n\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n            # Process each match\n            for match in LINK_PATENSION.finditer(raw_text):\n                label, doc_id = match.groups()\n                start_idx = f\"1.0+{match.start()}c\"\n                end_idx = f\"1.0+{match.end()}c\"\n\n                text_widget.tag_add(\"link\", start_idx, end_idx)\n                text_widget._links.append( (start_idx, end_idx, doc_id) )\n\n    I changed the _on_link_clicked to get the links list dynamically? But we stored it in text_widget._links. We should use that.\n\n    Actually, we did store it in text_widget._links, so we can use:\n\n        for ... in text_widget._links:\n\n    Also, note: we are appending to text_widget._links and then the event handler uses it. So it's the list from the latest parse_links call.\n\n    We must be cautious: if the text_widget is used in multiple contexts, we are setting attributes on it. We use:\n\n        text_widget._on_open_doc\n        text_widget._links\n        text_widget._link_handler_bound\n\n    This is acceptable.\n\n    Let me write the code accordingly.\n\n    But note: the event handler uses `text_widget._on_open_doc` which is set to the `on_open_doc` passed in the last call. And `text_widget._links` is also set to the last parsed set.\n\n    This should work.\n\n    However, note: what if the text widget is cleared and repopulated? That's what we are doing: we are deleting the tag and then re-adding the tags for the new text.\n\n    Therefore, I think this is a good solution.\n\n    Let me write the corrected function accordingly.\n\n    But wait: the original code also had the tag_bind for each match? Now we removed that and replaced with one tag_bind for the entire tag.\n\n    Also, note: when we add the tag \"link\", it's added to several spans. The event handler will be called for any click on any of these spans. Then we figure out which span by comparing the index.\n\n    This is efficient enough for a reasonable number of links.\n\n    I'll implement this.\n\n    One more note: the original code had a closure for each doc_id? That was causing the binding to be overwritten. Now we remove that.\n\n    Let's write the code accordingly.\n\n    However, note: the function _on_link_clicked is defined inside parse_links, but only once? Actually, it is defined only if it hasn't been bound. But we are defining it every time we call parse_links until it is bound. But then after the first time, we skip. So it's defined only once.\n\n    That's acceptable.\n\n    Code:\n\n        import re\n        import tkinter as tk\n\n        LINK_PATTERN = re.compile(r\"\\[([^\\]]+)]\\(doc:(\\d+)\\)\")\n\n\n        def parse_links(text_widget: tk.Text, raw_text: str, on_open_doc):\n            # Update the current callback and reset the links list\n            text_widget._on_open_doc = on_open_doc\n            text_widget._links = []   # reset the list of links\n\n            # Remove the old link formatting and re-configure\n            text_widget.tag_delete(\"link\")\n            text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n\n            # If we haven't bound the event handler yet, do it now\n            if not hasattr(text_widget, '_link_handler_bound'):\n                def _on_link_clicked(event):\n                    # Get the current index at the click\n                    index = text_widget.index(tk.CURRENT)\n                    # Check each link in the current list\n                    for (start, end, doc_id) in text_widget._links:\n                        if text_widget.compare(start, '<=', index) and text_widget.compare(index, '<', end):\n                            text_widget._on_open_doc(int(doc_id))\n                            break\n\n                text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n                text_widget._link_handler_bound = True\n\n            # Process each matched link\n            for match in LINK_PATTERN.finditer(raw_text):\n                label, doc_id = match.groups()\n                start_idx = f\"1.0+{match.start()}c\"\n                end_idx = f\"1.0+{match.end()}c\"\n\n                # Apply the link tag to the span\n                text_widget.tag_add(\"link\", start_idx, end_idx)\n\n                # Record the link info (start, end, doc_id) for this match\n                text_widget._links.append( (start_idx, end_idx, doc_id) )\n\n    This should fix the binding issue and also solve the late-binding issue.\n\n    Let me test with two links: \n        First call to parse_links: \n            _links = [ (start1, end1, id1), (start2, end2, id2) ]\n            Then when clicking on the first link, it will find the first one and call on_open_doc(id1)\n\n        Second call with new text and new on_open_doc? \n            Then text_widget._on_open_doc is updated, and _links is reset to the new links.\n\n    We assume the text widget already has the raw_text inserted? The caller is responsible for inserting the text? \n        The function expects the text widget to contain raw_text? Because it uses the indices in terms of the widget.\n\n    The function does not insert the text? It just parses and sets tags. So the caller must set the text first.\n\n    We'll leave it as is.\n\n    Now, I'll write the code accordingly.\n\n    But note: the pattern in the original code had a typo? \n        LINK_PATTERN = re.compile(r\"\\[([^\\]]+)]\\(doc:(\\d+)\\)\")\n    There's an extra bracket: we have `]+` then `)]` -> that might be a typo. But let's check:\n\n        Original: r\"\\[([^\\]]+)]\\(doc:(\\d+)\\)\"\n\n    This matches:\n        [label](doc:123)\n\n    The pattern: \n        \\[      : literal [\n        ([^\\]]+) : capture group: any character except ] (one or more)  -> label\n        ]       : literal ]   -> but then we have a closing bracket? \n        \\(      : literal (\n        doc:    : literal string\n        (\\d+)   : capture group: digits -> doc_id\n        \\)      : literal )\n\n    That pattern is correct? \n\n    But note: the label part: `([^\\]]+)` matches until the next ]? Then we require a closing ]. Then immediately an open parenthesis. \n\n    So the pattern is: [label](doc:123)\n\n    Yes, that matches.\n\n    Therefore, we keep the pattern.\n\n    Final code.\nThe original code had a critical issue where binding each link to the same \"link\" tag overwrote previous bindings, causing only the last link to work. Here's the corrected implementation:\nPython\nimport re\nimport tkinter as tk\n\nLINK_PATTERN = re.compile(r\"\\[([^\\]]+)]\\(doc:(\\d+)\\)\")\n\ndef parse_links(text_widget: tk.Text, raw_text: str, on_open_doc):\n    # Store doc_id handler and reset links list\n    text_widget._on_open_doc = on_open_doc\n    text_widget._links = []\n    \n    # Reset link tag formatting\n    text_widget.tag_delete(\"link\")\n    text_widget.tag_configure(\"link\", foreground=\"green\", underline=True)\n    \n    # Bind click handler if not already bound\n    if not hasattr(text_widget, '_link_handler_bound'):\n        def _on_link_clicked(event):\n            index = text_widget.index(tk.CURRENT)\n            for (start, end, doc_id) in text_widget._links:\n                if (text_widget.compare(start, '<=', index) and\n                    text_widget.compare(index, '<', end)):\n                    text_widget._on_open_doc(int(doc_id))\n                    break\n        \n        text_widget.tag_bind(\"link\", \"<Button-1>\", _on_link_clicked)\n        text_widget._link_handler_bound = True\n\n    # Process all matches\n    for match in LINK_PATTERN.finditer(raw_text):\n        label, doc_id = match.groups()\n        start_idx = f\"1.0+{match.start()}c\"\n        end_idx = f\"1\n\n"
}